bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>SDTR1</name>
               <displayName>SDTR1</displayName>
               <description>SDRAM Timing register 1</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TMRD</name>
                     <description>Load Mode Register to               Active</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXSR</name>
                     <description>Exit self-refresh delay</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRAS</name>
                     <description>Self refresh time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRC</name>
                     <description>Row cycle delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TWR</name>
                     <description>Recovery delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRP</name>
                     <description>Row precharge delay</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRCD</name>
                     <description>Row to column delay</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDTR2</name>
               <displayName>SDTR2</displayName>
               <description>SDRAM Timing register 2</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TMRD</name>
                     <description>Load Mode Register to               Active</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXSR</name>
                     <description>Exit self-refresh delay</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRAS</name>
                     <description>Self refresh time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRC</name>
                     <description>Row cycle delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TWR</name>
                     <description>Recovery delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRP</name>
                     <description>Row precharge delay</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRCD</name>
                     <description>Row to column delay</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDCMR</name>
               <displayName>SDCMR</displayName>
               <description>SDRAM Command Mode register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Command mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CTB2</name>
                     <description>Command target bank 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CTB1</name>
                     <description>Command target bank 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>NRFS</name>
                     <description>Number of Auto-refresh</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MRD</name>
                     <description>Mode Register definition</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>13</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDRTR</name>
               <displayName>SDRTR</displayName>
               <description>SDRAM Refresh Timer register</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRE</name>
                     <description>Clear Refresh error flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>COUNT</name>
                     <description>Refresh Timer Count</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>13</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>REIE</name>
                     <description>RES Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDSR</name>
               <displayName>SDSR</displayName>
               <description>SDRAM Status register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RE</name>
                     <description>Refresh error flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODES1</name>
                     <description>Status Mode for Bank 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODES2</name>
                     <description>Status Mode for Bank 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
