bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TIM3</name>
         <description>General purpose timers</description>
         <groupName>TIM</groupName>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TIM3</name>
            <description>TIM3 global interrupt</description>
            <value>29</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CKD</name>
                     <description>Clock division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ARPE</name>
                     <description>Auto-reload preload enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMS</name>
                     <description>Center-aligned mode               selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Direction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPM</name>
                     <description>One-pulse mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URS</name>
                     <description>Update request source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDIS</name>
                     <description>Update disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TI1S</name>
                     <description>TI1 selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MMS</name>
                     <description>Master mode selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CCDS</name>
                     <description>Capture/compare DMA               selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMCR</name>
               <displayName>SMCR</displayName>
               <description>slave mode control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>SMS</name>
                     <description>Slave mode selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TS</name>
                     <description>Trigger selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MSM</name>
                     <description>Master/Slave mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETF</name>
                     <description>External trigger filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ETPS</name>
                     <description>External trigger prescaler</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ECE</name>
                     <description>External clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETP</name>
                     <description>External trigger polarity</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMS_3</name>
                     <description>Slave model selection -               bit[3]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIER</name>
               <displayName>DIER</displayName>
               <description>DMA/Interrupt enable register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TDE</name>
                     <description>Trigger DMA request enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4DE</name>
                     <description>Capture/Compare 4 DMA request               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3DE</name>
                     <description>Capture/Compare 3 DMA request               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2DE</name>
                     <description>Capture/Compare 2 DMA request               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1DE</name>
                     <description>Capture/Compare 1 DMA request               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDE</name>
                     <description>Update DMA request enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE</name>
                     <description>Trigger interrupt enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4IE</name>
                     <description>Capture/Compare 4 interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3IE</name>
                     <description>Capture/Compare 3 interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2IE</name>
                     <description>Capture/Compare 2 interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1IE</name>
                     <description>Capture/Compare 1 interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIE</name>
                     <description>Update interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>status register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CC4OF</name>
                     <description>Capture/Compare 4 overcapture               flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3OF</name>
                     <description>Capture/Compare 3 overcapture               flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2OF</name>
                     <description>Capture/compare 2 overcapture               flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1OF</name>
                     <description>Capture/Compare 1 overcapture               flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIF</name>
                     <description>Trigger interrupt flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4IF</name>
                     <description>Capture/Compare 4 interrupt               flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3IF</name>
                     <description>Capture/Compare 3 interrupt               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2IF</name>
                     <description>Capture/Compare 2 interrupt               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1IF</name>
                     <description>Capture/compare 1 interrupt               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIF</name>
                     <description>Update interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EGR</name>
               <displayName>EGR</displayName>
               <description>event generation register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TG</name>
                     <description>Trigger generation</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4G</name>
                     <description>Capture/compare 4               generation</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3G</name>
                     <description>Capture/compare 3               generation</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2G</name>
                     <description>Capture/compare 2               generation</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1G</name>
                     <description>Capture/compare 1               generation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UG</name>
                     <description>Update generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR1_Output</name>
               <displayName>CCMR1_Output</displayName>
               <description>capture/compare mode register 1 (output           mode)</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OC2CE</name>
                     <description>OC2CE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC2M</name>
                     <description>OC2M</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC2PE</name>
                     <description>OC2PE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC2FE</name>
                     <description>OC2FE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2S</name>
                     <description>CC2S</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OC1CE</name>
                     <description>OC1CE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC1M</name>
                     <description>OC1M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC1PE</name>
                     <description>OC1PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC1FE</name>
                     <description>OC1FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1S</name>
                     <description>CC1S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR1_Input</name>
               <displayName>CCMR1_Input</displayName>
               <description>capture/compare mode register 1 (input           mode)</description>
               <alternateRegister>CCMR1_Output</alternateRegister>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC2F</name>
                     <description>Input capture 2 filter</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IC2PCS</name>
                     <description>Input capture 2 prescaler</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CC2S</name>
                     <description>Capture/Compare 2               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IC1F</name>
                     <description>Input capture 1 filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ICPCS</name>
                     <description>Input capture 1 prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CC1S</name>
                     <description>Capture/Compare 1               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCMR2_Output</name>
               <displayName>CCMR2_Output</displayName>
               <description>capture/compare mode register 2 (output           mode)</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>O24CE</name>
                     <description>O24CE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC4M</name>
                     <description>OC4M</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC4PE</name>
                     <description>OC4PE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC4FE</name>
                     <description>OC4FE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4S</name>
                     <description>CC4S</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OC3CE</name>
                     <description>OC3CE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC3M</name>
                     <description>OC3M</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OC3PE</name>
                     <description>OC3PE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC3FE</name>
                     <description>OC3FE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3S</name>
                     <description>CC3S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
