bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>QMEM2_7</name>
               <displayName>QMEM2_7</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xEC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_8</name>
               <displayName>QMEM2_8</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xF0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_9</name>
               <displayName>QMEM2_9</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xF4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_10</name>
               <displayName>QMEM2_10</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xF8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_11</name>
               <displayName>QMEM2_11</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xFC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_12</name>
               <displayName>QMEM2_12</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_13</name>
               <displayName>QMEM2_13</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_14</name>
               <displayName>QMEM2_14</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_15</name>
               <displayName>QMEM2_15</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_0</name>
               <displayName>QMEM3_0</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_1</name>
               <displayName>QMEM3_1</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_2</name>
               <displayName>QMEM3_2</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_3</name>
               <displayName>QMEM3_3</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x11C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_4</name>
               <displayName>QMEM3_4</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x120</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_5</name>
               <displayName>QMEM3_5</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x124</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_6</name>
               <displayName>QMEM3_6</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x128</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_7</name>
               <displayName>QMEM3_7</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x12C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_8</name>
               <displayName>QMEM3_8</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x130</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_9</name>
               <displayName>QMEM3_9</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x134</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_10</name>
               <displayName>QMEM3_10</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x138</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_11</name>
               <displayName>QMEM3_11</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x13C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_12</name>
               <displayName>QMEM3_12</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_13</name>
               <displayName>QMEM3_13</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_14</name>
               <displayName>QMEM3_14</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM3_15</name>
               <displayName>QMEM3_15</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_0</name>
               <displayName>HUFFMIN_0</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_1</name>
               <displayName>HUFFMIN_1</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_2</name>
               <displayName>HUFFMIN_2</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_3</name>
               <displayName>HUFFMIN_3</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_4</name>
               <displayName>HUFFMIN_4</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_5</name>
               <displayName>HUFFMIN_5</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_6</name>
               <displayName>HUFFMIN_6</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_7</name>
               <displayName>HUFFMIN_7</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x16C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_8</name>
               <displayName>HUFFMIN_8</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_9</name>
               <displayName>HUFFMIN_9</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x174</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
