bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>HUFFMIN_10</name>
               <displayName>HUFFMIN_10</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_11</name>
               <displayName>HUFFMIN_11</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x17C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_12</name>
               <displayName>HUFFMIN_12</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_13</name>
               <displayName>HUFFMIN_13</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_14</name>
               <displayName>HUFFMIN_14</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x188</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFMIN_15</name>
               <displayName>HUFFMIN_15</displayName>
               <description>JPEG HuffMin tables</description>
               <addressOffset>0x18C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffMin_RAM</name>
                     <description>HuffMin RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE0</name>
               <displayName>HUFFBASE0</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x190</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE1</name>
               <displayName>HUFFBASE1</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x194</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE2</name>
               <displayName>HUFFBASE2</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x198</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE3</name>
               <displayName>HUFFBASE3</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x19C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE4</name>
               <displayName>HUFFBASE4</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE5</name>
               <displayName>HUFFBASE5</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE6</name>
               <displayName>HUFFBASE6</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1A8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE7</name>
               <displayName>HUFFBASE7</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1AC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE8</name>
               <displayName>HUFFBASE8</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1B0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE9</name>
               <displayName>HUFFBASE9</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1B4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE10</name>
               <displayName>HUFFBASE10</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1B8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE11</name>
               <displayName>HUFFBASE11</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1BC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE12</name>
               <displayName>HUFFBASE12</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1C0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE13</name>
               <displayName>HUFFBASE13</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1C4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE14</name>
               <displayName>HUFFBASE14</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1C8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE15</name>
               <displayName>HUFFBASE15</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1CC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE16</name>
               <displayName>HUFFBASE16</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1D0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE17</name>
               <displayName>HUFFBASE17</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1D4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE18</name>
               <displayName>HUFFBASE18</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1D8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE19</name>
               <displayName>HUFFBASE19</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE20</name>
               <displayName>HUFFBASE20</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
