bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DFSDM1</name>
         <description>Digital filter for sigma delta       modulators</description>
         <groupName>DFSDM</groupName>
         <baseAddress>0x40017400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DFSDM1_FLT0</name>
            <description>DFSDM1 Filter 0 global interrupt</description>
            <value>99</value>
         </interrupt>
         <interrupt>
            <name>DFSDM1_FLT1</name>
            <description>DFSDM1 Filter 1 global interrupt</description>
            <value>100</value>
         </interrupt>
         <interrupt>
            <name>DFSDM1_FLT2</name>
            <description>DFSDM1 Filter 2 global interrupt</description>
            <value>101</value>
         </interrupt>
         <interrupt>
            <name>DFSDM1_FLT3</name>
            <description>DFSDM1 Filter 3 global interrupt</description>
            <value>102</value>
         </interrupt>
         <registers>
            <register>
               <name>DFSDM_CHCFG0R1</name>
               <displayName>DFSDM_CHCFG0R1</displayName>
               <description>DFSDM channel configuration 0 register           1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 0 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG1R1</name>
               <displayName>DFSDM_CHCFG1R1</displayName>
               <description>DFSDM channel configuration 1 register           1</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 1 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG2R1</name>
               <displayName>DFSDM_CHCFG2R1</displayName>
               <description>DFSDM channel configuration 2 register           1</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 2 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG3R1</name>
               <displayName>DFSDM_CHCFG3R1</displayName>
               <description>DFSDM channel configuration 3 register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 3 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG4R1</name>
               <displayName>DFSDM_CHCFG4R1</displayName>
               <description>DFSDM channel configuration 4 register           1</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               4</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               4</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               4</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 4 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG5R1</name>
               <displayName>DFSDM_CHCFG5R1</displayName>
               <description>DFSDM channel configuration 5 register           1</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               5</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               5</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 5 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               5</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
