bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>DFSDM_CHCFG6R1</name>
               <displayName>DFSDM_CHCFG6R1</displayName>
               <description>DFSDM channel configuration 6 register           1</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               6</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               6</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 6 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               6</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG7R1</name>
               <displayName>DFSDM_CHCFG7R1</displayName>
               <description>DFSDM channel configuration 7 register           1</description>
               <addressOffset>0xE0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SITP</name>
                     <description>Serial interface type for channel               7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SPICKSEL</name>
                     <description>SPI clock select for channel               7</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SCDEN</name>
                     <description>Short-circuit detector enable on channel               7</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABEN</name>
                     <description>Clock absence detector enable on channel               7</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel 7 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINSEL</name>
                     <description>Channel inputs selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATMPX</name>
                     <description>Input data multiplexer for channel               7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATPACK</name>
                     <description>Data packing mode in DFSDM_CHDATINyR               register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTDIV</name>
                     <description>Output serial clock               divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKOUTSRC</name>
                     <description>Output serial clock source               selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFSDMEN</name>
                     <description>Global enable for DFSDM               interface</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG0R2</name>
               <displayName>DFSDM_CHCFG0R2</displayName>
               <description>DFSDM channel configuration 0 register           2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG1R2</name>
               <displayName>DFSDM_CHCFG1R2</displayName>
               <description>DFSDM channel configuration 1 register           2</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG2R2</name>
               <displayName>DFSDM_CHCFG2R2</displayName>
               <description>DFSDM channel configuration 2 register           2</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG3R2</name>
               <displayName>DFSDM_CHCFG3R2</displayName>
               <description>DFSDM channel configuration 3 register           2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG4R2</name>
               <displayName>DFSDM_CHCFG4R2</displayName>
               <description>DFSDM channel configuration 4 register           2</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG5R2</name>
               <displayName>DFSDM_CHCFG5R2</displayName>
               <description>DFSDM channel configuration 5 register           2</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               5</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG6R2</name>
               <displayName>DFSDM_CHCFG6R2</displayName>
               <description>DFSDM channel configuration 6 register           2</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               6</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHCFG7R2</name>
               <displayName>DFSDM_CHCFG7R2</displayName>
               <description>DFSDM channel configuration 7 register           2</description>
               <addressOffset>0xE4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTRBS</name>
                     <description>Data right bit-shift for channel               7</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET</name>
                     <description>24-bit calibration offset for channel               7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD0R</name>
               <displayName>DFSDM_AWSCD0R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 0</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD1R</name>
               <displayName>DFSDM_AWSCD1R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD2R</name>
               <displayName>DFSDM_AWSCD2R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 2</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD3R</name>
               <displayName>DFSDM_AWSCD3R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 3</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD4R</name>
               <displayName>DFSDM_AWSCD4R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 4</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
