bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>DFSDM1_CR1</name>
               <displayName>DFSDM1_CR1</displayName>
               <description>DFSDM control register 1</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DFEN</name>
                     <description>DFSDM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSWSTART</name>
                     <description>Start a conversion of the injected group               of channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSYNC</name>
                     <description>Launch an injected conversion               synchronously with the DFSDM0 JSWSTART               trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSCAN</name>
                     <description>Scanning conversion mode for injected               conversions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDMAEN</name>
                     <description>DMA channel enabled to read data for the               injected channel group</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>Trigger signal selection for launching               injected conversions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>Trigger enable and trigger edge               selection for injected conversions</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RSWSTART</name>
                     <description>Software start of a conversion on the               regular channel</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCONT</name>
                     <description>Continuous mode selection for regular               conversions</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSYNC</name>
                     <description>Launch regular conversion synchronously               with DFSDM0</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDMAEN</name>
                     <description>DMA channel enabled to read data for the               regular conversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCH</name>
                     <description>Regular channel selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FAST</name>
                     <description>Fast conversion mode selection for               regular conversions</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWFSEL</name>
                     <description>Analog watchdog fast mode               select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_CR1</name>
               <displayName>DFSDM2_CR1</displayName>
               <description>DFSDM control register 1</description>
               <addressOffset>0x200</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DFEN</name>
                     <description>DFSDM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSWSTART</name>
                     <description>Start a conversion of the injected group               of channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSYNC</name>
                     <description>Launch an injected conversion               synchronously with the DFSDM0 JSWSTART               trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSCAN</name>
                     <description>Scanning conversion mode for injected               conversions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDMAEN</name>
                     <description>DMA channel enabled to read data for the               injected channel group</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>Trigger signal selection for launching               injected conversions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>Trigger enable and trigger edge               selection for injected conversions</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RSWSTART</name>
                     <description>Software start of a conversion on the               regular channel</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCONT</name>
                     <description>Continuous mode selection for regular               conversions</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSYNC</name>
                     <description>Launch regular conversion synchronously               with DFSDM0</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDMAEN</name>
                     <description>DMA channel enabled to read data for the               regular conversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCH</name>
                     <description>Regular channel selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FAST</name>
                     <description>Fast conversion mode selection for               regular conversions</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWFSEL</name>
                     <description>Analog watchdog fast mode               select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_CR1</name>
               <displayName>DFSDM3_CR1</displayName>
               <description>DFSDM control register 1</description>
               <addressOffset>0x380</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DFEN</name>
                     <description>DFSDM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSWSTART</name>
                     <description>Start a conversion of the injected group               of channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSYNC</name>
                     <description>Launch an injected conversion               synchronously with the DFSDM0 JSWSTART               trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSCAN</name>
                     <description>Scanning conversion mode for injected               conversions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDMAEN</name>
                     <description>DMA channel enabled to read data for the               injected channel group</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>Trigger signal selection for launching               injected conversions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>Trigger enable and trigger edge               selection for injected conversions</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RSWSTART</name>
                     <description>Software start of a conversion on the               regular channel</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCONT</name>
                     <description>Continuous mode selection for regular               conversions</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSYNC</name>
                     <description>Launch regular conversion synchronously               with DFSDM0</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDMAEN</name>
                     <description>DMA channel enabled to read data for the               regular conversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCH</name>
                     <description>Regular channel selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FAST</name>
                     <description>Fast conversion mode selection for               regular conversions</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWFSEL</name>
                     <description>Analog watchdog fast mode               select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_CR2</name>
               <displayName>DFSDM0_CR2</displayName>
               <description>DFSDM control register 2</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JEOCIE</name>
                     <description>Injected end of conversion interrupt               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCIE</name>
                     <description>Regular end of conversion interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRIE</name>
                     <description>Injected data overrun interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRIE</name>
                     <description>Regular data overrun interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDIE</name>
                     <description>Analog watchdog interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCDIE</name>
                     <description>Short-circuit detector interrupt               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABIE</name>
                     <description>Clock absence interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCH</name>
                     <description>Extremes detector channel               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH</name>
                     <description>Analog watchdog channel               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_CR2</name>
               <displayName>DFSDM1_CR2</displayName>
               <description>DFSDM control register 2</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JEOCIE</name>
                     <description>Injected end of conversion interrupt               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCIE</name>
                     <description>Regular end of conversion interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRIE</name>
                     <description>Injected data overrun interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRIE</name>
                     <description>Regular data overrun interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDIE</name>
                     <description>Analog watchdog interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCDIE</name>
                     <description>Short-circuit detector interrupt               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABIE</name>
                     <description>Clock absence interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCH</name>
                     <description>Extremes detector channel               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH</name>
                     <description>Analog watchdog channel               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_CR2</name>
               <displayName>DFSDM2_CR2</displayName>
               <description>DFSDM control register 2</description>
               <addressOffset>0x204</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JEOCIE</name>
                     <description>Injected end of conversion interrupt               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCIE</name>
                     <description>Regular end of conversion interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRIE</name>
                     <description>Injected data overrun interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRIE</name>
                     <description>Regular data overrun interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDIE</name>
                     <description>Analog watchdog interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCDIE</name>
                     <description>Short-circuit detector interrupt               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABIE</name>
                     <description>Clock absence interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCH</name>
                     <description>Extremes detector channel               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH</name>
                     <description>Analog watchdog channel               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
