bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>DFSDM0_FCR</name>
               <displayName>DFSDM0_FCR</displayName>
               <description>DFSDM filter control register</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IOSR</name>
                     <description>Integrator oversampling ratio (averaging               length)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FOSR</name>
                     <description>Sinc filter oversampling ratio               (decimation rate)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FORD</name>
                     <description>Sinc filter order</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_FCR</name>
               <displayName>DFSDM1_FCR</displayName>
               <description>DFSDM filter control register</description>
               <addressOffset>0x194</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IOSR</name>
                     <description>Integrator oversampling ratio (averaging               length)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FOSR</name>
                     <description>Sinc filter oversampling ratio               (decimation rate)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FORD</name>
                     <description>Sinc filter order</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_FCR</name>
               <displayName>DFSDM2_FCR</displayName>
               <description>DFSDM filter control register</description>
               <addressOffset>0x214</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IOSR</name>
                     <description>Integrator oversampling ratio (averaging               length)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FOSR</name>
                     <description>Sinc filter oversampling ratio               (decimation rate)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FORD</name>
                     <description>Sinc filter order</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_FCR</name>
               <displayName>DFSDM3_FCR</displayName>
               <description>DFSDM filter control register</description>
               <addressOffset>0x314</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IOSR</name>
                     <description>Integrator oversampling ratio (averaging               length)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FOSR</name>
                     <description>Sinc filter oversampling ratio               (decimation rate)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FORD</name>
                     <description>Sinc filter order</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_JDATAR</name>
               <displayName>DFSDM0_JDATAR</displayName>
               <description>DFSDM data register for injected           group</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATACH</name>
                     <description>Injected channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JDATA</name>
                     <description>Injected group conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_JDATAR</name>
               <displayName>DFSDM1_JDATAR</displayName>
               <description>DFSDM data register for injected           group</description>
               <addressOffset>0x198</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATACH</name>
                     <description>Injected channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JDATA</name>
                     <description>Injected group conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_JDATAR</name>
               <displayName>DFSDM2_JDATAR</displayName>
               <description>DFSDM data register for injected           group</description>
               <addressOffset>0x218</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATACH</name>
                     <description>Injected channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JDATA</name>
                     <description>Injected group conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_JDATAR</name>
               <displayName>DFSDM3_JDATAR</displayName>
               <description>DFSDM data register for injected           group</description>
               <addressOffset>0x318</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATACH</name>
                     <description>Injected channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JDATA</name>
                     <description>Injected group conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_RDATAR</name>
               <displayName>DFSDM0_RDATAR</displayName>
               <description>DFSDM data register for the regular           channel</description>
               <addressOffset>0x11C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATACH</name>
                     <description>Regular channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RPEND</name>
                     <description>Regular channel pending               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDATA</name>
                     <description>Regular channel conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_RDATAR</name>
               <displayName>DFSDM1_RDATAR</displayName>
               <description>DFSDM data register for the regular           channel</description>
               <alternateRegister>DFSDM1_JDATAR</alternateRegister>
               <addressOffset>0x198</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATACH</name>
                     <description>Regular channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RPEND</name>
                     <description>Regular channel pending               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDATA</name>
                     <description>Regular channel conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_RDATAR</name>
               <displayName>DFSDM2_RDATAR</displayName>
               <description>DFSDM data register for the regular           channel</description>
               <alternateRegister>DFSDM2_JDATAR</alternateRegister>
               <addressOffset>0x218</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATACH</name>
                     <description>Regular channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RPEND</name>
                     <description>Regular channel pending               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDATA</name>
                     <description>Regular channel conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_RDATAR</name>
               <displayName>DFSDM3_RDATAR</displayName>
               <description>DFSDM data register for the regular           channel</description>
               <alternateRegister>DFSDM3_JDATAR</alternateRegister>
               <addressOffset>0x318</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATACH</name>
                     <description>Regular channel most recently               converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RPEND</name>
                     <description>Regular channel pending               data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDATA</name>
                     <description>Regular channel conversion               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_AWHTR</name>
               <displayName>DFSDM0_AWHTR</displayName>
               <description>DFSDM analog watchdog high threshold           register</description>
               <addressOffset>0x120</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWH</name>
                     <description>Break signal assignment to analog               watchdog high threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWHT</name>
                     <description>Analog watchdog high               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_AWHTR</name>
               <displayName>DFSDM1_AWHTR</displayName>
               <description>DFSDM analog watchdog high threshold           register</description>
               <addressOffset>0x1A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWH</name>
                     <description>Break signal assignment to analog               watchdog high threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWHT</name>
                     <description>Analog watchdog high               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_AWHTR</name>
               <displayName>DFSDM2_AWHTR</displayName>
               <description>DFSDM analog watchdog high threshold           register</description>
               <addressOffset>0x220</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWH</name>
                     <description>Break signal assignment to analog               watchdog high threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWHT</name>
                     <description>Analog watchdog high               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_AWHTR</name>
               <displayName>DFSDM3_AWHTR</displayName>
               <description>DFSDM analog watchdog high threshold           register</description>
               <addressOffset>0x2A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWH</name>
                     <description>Break signal assignment to analog               watchdog high threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWHT</name>
                     <description>Analog watchdog high               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_AWLTR</name>
               <displayName>DFSDM0_AWLTR</displayName>
               <description>DFSDM analog watchdog low threshold           register</description>
               <addressOffset>0x124</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWL</name>
                     <description>Break signal assignment to analog               watchdog low threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWLT</name>
                     <description>Analog watchdog low               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_AWLTR</name>
               <displayName>DFSDM1_AWLTR</displayName>
               <description>DFSDM analog watchdog low threshold           register</description>
               <addressOffset>0x1A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWL</name>
                     <description>Break signal assignment to analog               watchdog low threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWLT</name>
                     <description>Analog watchdog low               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_AWLTR</name>
               <displayName>DFSDM2_AWLTR</displayName>
               <description>DFSDM analog watchdog low threshold           register</description>
               <addressOffset>0x224</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWL</name>
                     <description>Break signal assignment to analog               watchdog low threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWLT</name>
                     <description>Analog watchdog low               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_AWLTR</name>
               <displayName>DFSDM3_AWLTR</displayName>
               <description>DFSDM analog watchdog low threshold           register</description>
               <addressOffset>0x2A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKAWL</name>
                     <description>Break signal assignment to analog               watchdog low threshold event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWLT</name>
                     <description>Analog watchdog low               threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
