bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>DSI_FIR0</name>
               <displayName>DSI_FIR0</displayName>
               <description>DSI Host Force Interrupt Register           0</description>
               <addressOffset>0xD8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FAE0</name>
                     <description>Force Acknowledge Error 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE1</name>
                     <description>Force Acknowledge Error 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE2</name>
                     <description>Force Acknowledge Error 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE3</name>
                     <description>Force Acknowledge Error 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE4</name>
                     <description>Force Acknowledge Error 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE5</name>
                     <description>Force Acknowledge Error 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE6</name>
                     <description>Force Acknowledge Error 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE7</name>
                     <description>Force Acknowledge Error 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE8</name>
                     <description>Force Acknowledge Error 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE9</name>
                     <description>Force Acknowledge Error 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE10</name>
                     <description>Force Acknowledge Error 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE11</name>
                     <description>Force Acknowledge Error 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE12</name>
                     <description>Force Acknowledge Error 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE13</name>
                     <description>Force Acknowledge Error 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE14</name>
                     <description>Force Acknowledge Error 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAE15</name>
                     <description>Force Acknowledge Error 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPE0</name>
                     <description>Force PHY Error 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPE1</name>
                     <description>Force PHY Error 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPE2</name>
                     <description>Force PHY Error 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPE3</name>
                     <description>Force PHY Error 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPE4</name>
                     <description>Force PHY Error 4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_FIR1</name>
               <displayName>DSI_FIR1</displayName>
               <description>DSI Host Force Interrupt Register           1</description>
               <addressOffset>0xDC</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FTOHSTX</name>
                     <description>Force Timeout High-Speed               Transmission</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTOLPRX</name>
                     <description>Force Timeout Low-Power               Reception</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECCSE</name>
                     <description>Force ECC Single-bit Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECCME</name>
                     <description>Force ECC Multi-bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCRCE</name>
                     <description>Force CRC Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPSE</name>
                     <description>Force Packet Size Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEOTPE</name>
                     <description>Force EoTp Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLPWRE</name>
                     <description>Force LTDC Payload Write               Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FGCWRE</name>
                     <description>Force Generic Command Write               Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FGPWRE</name>
                     <description>Force Generic Payload Write               Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FGPTXE</name>
                     <description>Force Generic Payload Transmit               Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FGPRDE</name>
                     <description>Force Generic Payload Read               Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FGPRXE</name>
                     <description>Force Generic Payload Receive               Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VSCR</name>
               <displayName>DSI_VSCR</displayName>
               <description>DSI Host Video Shadow Control           Register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UR</name>
                     <description>Update Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LCVCIDR</name>
               <displayName>DSI_LCVCIDR</displayName>
               <description>DSI Host LTDC Current VCID           Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCID</name>
                     <description>Virtual Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LCCCR</name>
               <displayName>DSI_LCCCR</displayName>
               <description>DSI Host LTDC Current Color Coding           Register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COLC</name>
                     <description>Color Coding</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LPE</name>
                     <description>Loosely Packed Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LPMCCR</name>
               <displayName>DSI_LPMCCR</displayName>
               <description>DSI Host Low-Power mode Current           Configuration Register</description>
               <addressOffset>0x118</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VLPSIZE</name>
                     <description>VACT Largest Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LPSIZE</name>
                     <description>Largest Packet Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VMCCR</name>
               <displayName>DSI_VMCCR</displayName>
               <description>DSI Host Video mode Current Configuration           Register</description>
               <addressOffset>0x138</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VMT</name>
                     <description>Video mode Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPVSAE</name>
                     <description>Low-Power Vertical Sync time               Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVBPE</name>
                     <description>Low-power Vertical Back-Porch               Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVFPE</name>
                     <description>Low-power Vertical Front-Porch               Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVAE</name>
                     <description>Low-Power Vertical Active               Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPHBPE</name>
                     <description>Low-power Horizontal Back-Porch               Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPHFE</name>
                     <description>Low-Power Horizontal Front-Porch               Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FBTAAE</name>
                     <description>Frame BTA Acknowledge               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPCE</name>
                     <description>Low-Power Command Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VPCCR</name>
               <displayName>DSI_VPCCR</displayName>
               <description>DSI Host Video Packet Current Configuration           Register</description>
               <addressOffset>0x13C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VPSIZE</name>
                     <description>Video Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VCCCR</name>
               <displayName>DSI_VCCCR</displayName>
               <description>DSI Host Video Chunks Current Configuration           Register</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NUMC</name>
                     <description>Number of Chunks</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VNPCCR</name>
               <displayName>DSI_VNPCCR</displayName>
               <description>DSI Host Video Null Packet Current           Configuration Register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NPSIZE</name>
                     <description>Null Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VHSACCR</name>
               <displayName>DSI_VHSACCR</displayName>
               <description>DSI Host Video HSA Current Configuration           Register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSA</name>
                     <description>Horizontal Synchronism Active               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VHBPCCR</name>
               <displayName>DSI_VHBPCCR</displayName>
               <description>DSI Host Video HBP Current Configuration           Register</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HBP</name>
                     <description>Horizontal Back-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VLCCR</name>
               <displayName>DSI_VLCCR</displayName>
               <description>DSI Host Video Line Current Configuration           Register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HLINE</name>
                     <description>Horizontal Line duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVSACCR</name>
               <displayName>DSI_VVSACCR</displayName>
               <description>DSI Host Video VSA Current Configuration           Register</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VSA</name>
                     <description>Vertical Synchronism Active               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVBPCCR</name>
               <displayName>DSI_VVBPCCR</displayName>
               <description>DSI Host Video VBP Current Configuration           Register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBP</name>
                     <description>Vertical Back-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVFPCCR</name>
               <displayName>DSI_VVFPCCR</displayName>
               <description>DSI Host Video VFP Current Configuration           Register</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VFP</name>
                     <description>Vertical Front-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVACCR</name>
               <displayName>DSI_VVACCR</displayName>
               <description>DSI Host Video VA Current Configuration           Register</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VA</name>
                     <description>Vertical Active duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
