bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F765.svd
            <register>
               <name>DSI_WRPCR</name>
               <displayName>DSI_WRPCR</displayName>
               <description>DSI Wrapper Regulator and PLL Control           Register</description>
               <addressOffset>0x430</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REGEN</name>
                     <description>Regulator Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODF</name>
                     <description>PLL Output Division Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IDF</name>
                     <description>PLL Input Division Factor</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NDIV</name>
                     <description>PLL Loop Division Factor</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PLLEN</name>
                     <description>PLL Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
